1.1 начало

вам нужно 

1. написать программу где-то
2. успешно ее скомпилировать
3. запустить ее на выполнение
4. разобраться куда будет отправлен ее результат

```c
#include <stdio.h>

int main (){
    printf("Hello World!\n");

    return 0;
}
```

**Как запустить эту программу ? Зависит от системы котору. вы используете**

В UNIX - необходимо написать программу в файле с расширением hello**.c**

Затем скомпилировать ее с помоиощью компилятора `GCC hello.c`

Компилятор скомпилирует программу с именем **a.out**

Чтобы запустить ее на linux, введите комианду `./a.out`

Программа выведет в вывод `Здравстуй Мир!`

**main** - обязательная функция - с нее начинаюются все вычисления.

Функции пишет обычно программист для своей программы, но и пользуется сторонними. Одна из низ функция **printf() -** она включается из имеющихся библиотек

 `#include <stdio.h>` - сообщает компилятору, что он должен включить информацию о стандартной библиотеке ввода-вывода.

`printf(”Привет мир! \n”)` - последовательность символов заключенные в кавычки - называется **строкой символов** или **строковой константой**

`\n` - эскейп последовательность. символ перехода на новую строку